export const comments = [
  {
    id: 'sjf21',
    author: 'StalonoiVolk',
    postDate: 'August 29, 2018',
    comment: `Добрый день, уважаемые абитуриенты WGA!

      Вступление в ряды студентов Академии происходит на конкурсной основе. 
      
      1 этап: выполнение тестового задания. Вам необходимо выбрать направление, за которое Вы хотите быть ответственными в процессе разработки игры (во время учебного года роли могут меняться), и выполнить тестовое задание по нему. Готовое тестовое задание необходимо будет прислать на почту wga_spb@wargaming.net c темой письма "Тестовое задание для поступления". 
      
      2 этап: личная встреча с представителями Wargaming St Petersburg`,
    parentId: null,
  },
  {
    id: 'fqfe1',
    author: 'StalonoiVolk',
    postDate: 'August 29, 2018',
    comment: `Добрый день, уважаемые абитуриенты WGA!

      Вступление в ряды студентов Академии происходит на конкурсной основе. 
      
      1 этап: выполнение тестового задания. Вам необходимо выбрать направление, за которое Вы хотите быть ответственными в процессе разработки игры (во время учебного года роли могут меняться), и выполнить тестовое задание по нему. Готовое тестовое задание необходимо будет прислать на почту wga_spb@wargaming.net c темой письма "Тестовое задание для поступления". 
      
      2 этап: личная встреча с представителями Wargaming St Petersburg`,
    parentId: 'sjf21',
  },
]
