import React from 'react'

export const Home = () => {
  return (
    <>
      <div
        className="home-page"
        style={{
          display: 'flex',
          flexDirection: 'column',
          alignItems: 'center',
        }}>
        <h1 className="home-page__title">
          WoT Generals - игра для настоящих мужчин!
        </h1>
        <section className="home-page__description">
          <h2 className="home-page__section-title">Краткое описание игры.</h2>
          <p className="home-page__text">
            World of Tanks Generals представляет собой пошаговую стратегию с
            двумя типами матчей — матчами один на один с реальным противником и
            тренировочными боями против ИИ. Игровой процесс происходит на
            игровом поле высотой три и шириной пять клеток. Колода каждого
            игрока состоит из 40 карт, в «руке» игрока находится до 6 карт;
            игроки размещают свои карты танков в квадратах, окружающих их карту
            штаба. После развёртывания карт игроки могут перемещать карты танков
            на любую соседнюю незанятую позицию во время своих ходов. Побеждает
            игрок, чьи карты танков понижают очки прочности карты штаба
            противника до нуля.
          </p>
        </section>
        <section className="home-page__instruction">
          <h2 className="home-page__section-title">
            Небольшой инструктаж по механике.
          </h2>
          <p className="home-page__text">
            После выхода в бой открывается экран сражения:
          </p>
          <ul className="home-page__instruction-list">
            <li className="home-page__instruction-item">
              <h3>Поле боя</h3>
              Местом основных боевых действий является поле боя , разделённое на
              15 клеток.
            </li>
            <li className="home-page__instruction-item">
              <h3>Рука игрока и потери</h3>
              Перед боем каждый игрок получает по шесть карт из колоды 6. Карты
              выбираются случайным образом. Эти шесть карт являются стартовой
              рукой. В начале каждого своего хода игрок получает в руку по одной
              карте из колоды. Карта выбирается случайным образом. Однако игрок,
              который ходит первым, не получает карту в свой первый ход.
            </li>
            <li className="home-page__instruction-item">
              <h3>Ресурсы и прирост ресурсов</h3>
              Ресурсы — это средства для платы за розыгрыш карт из руки. Прирост
              ресурсов карты — это количество ресурсов, которое карта приносит
              каждый ход, если находится на поле боя или в зоне поддержки штаба.
            </li>
          </ul>
        </section>
        <button
          style={{
            width: '200px',
            height: '50px',
          }}>
          В бой!
        </button>
      </div>
    </>
  )
}
